//Завдання 5
//Створіть проєкт. Створіть змінну типу byte, надайте їй значення 99999, виведіть значення цієї змінної в консоль.
// За виникнення помилки, використовуючи коментарі, напишіть, у чому помилка та привласніть це значення
// до відповідного типу даних.
public class Solution005 {
    public static void main(String[] args) {
        byte variable = (byte) 99999;

        System.out.println(variable);
        /*
        99999 виходить за межі типу byte, тому:
        Значення змінної variable звузили до типу byte і вивели на екран
        */
    }
}
