//Завдання 4
//
// Використовуючи IntelliJ IDEA, створіть клас Volume. Напишіть програму розрахунку об'єму – V та площі поверхні -S
// циліндра. Об'єм V циліндра радіусом – R та висотою – h, обчислюється за формулою: V = πR2h. Площа поверхні циліндра
// обчислюється за формулою: S = 2πR2 + 2πR2 = 2πR(R+h). Результати розрахунків виведіть на екран.
public class Volume {
    public static void main(String[] args) {
        final double PI = 3.14;
        int R = 3;
        int h = 10;
        double V = 0;
        double S = 0;

        V = PI * Math.pow(R, 2) * h;
        S = 2 * PI * R * (h + R);
        System.out.println("Об'єм циліндра дорівнює: " + V + "; Площа циліндра дорівнює: " + S);
    }
}
