import java.util.Scanner;

//Завдання 4
//
//Використовуючи IntelliJ IDEA, створіть клас Premium. Напишіть програму розрахунку нарахування премій працівникам.
// Премії розраховуються згідно з вислугою років. Якщо вислуга до 5 років, премія становить 10% від заробітної плати.
// Якщо вислуга від 5 років (включно) до 10 років, то премія становить 15% від заробітної плати. Якщо вислуга від 10
// років (включно) до 15 років, премія становить 25% від заробітної плати. Якщо вислуга від 15 років (включно) до 20
// років, премія становить 35% від заробітної плати. Якщо вислуга від 20 років (включно) до 25 років, премія становить
// 45% від заробітної плати. Якщо вислуга від 25 років (включно) та більше, премія складає 50% від заробітної плати.
// Результати розрахунку виведіть на екран.
public class Premium {
    public static void main(String[] args) {
        double salary = 3000;
        Scanner scanner = new Scanner(System.in);
        System.out.println("Введіть скільки років співробітник пропрацював: ");
        int experience = scanner.nextInt();

        if (experience < 5)
            System.out.println("Співробітнику нараховано такий розмір премії: " + salary * 1.1);
        else if (experience >= 5 && experience < 10)
            System.out.println("Співробітнику нараховано такий розмір премії: " + salary * 1.15);
        else if (experience >= 10 && experience < 15)
            System.out.println("Співробітнику нараховано такий розмір премії: " + salary * 1.25);
        else if (experience >= 15 && experience < 20)
            System.out.println("Співробітнику нараховано такий розмір премії: " + salary * 1.35);
        else if (experience >= 20 && experience < 25)
            System.out.println("Співробітнику нараховано такий розмір премії: " + salary * 1.45);
        else if (experience >= 25)
            System.out.println("Співробітнику нараховано такий розмір премії: " + salary * 1.5);
    }
}
