//Завдання 3
//
//Використовуючи IntelliJ IDEA, створіть клас ReversedArray. Створити метод myReverse(int [] array), який приймає як
// аргумент масив цілочислових елементів і повертає інвертований масив (елементи масиву у зворотному порядку). Створити
// метод int [] subArray (int [] array, int index, int count). Метод повертає частину отриманого як аргумент масиву,
// починаючи з позиції, яка зазначена в аргументі index, розмірністю, що відповідає значенню аргументу count. Якщо
// аргумент count містить значення більше, ніж кількість елементів, що входять до частини вихідного масиву (від
// зазначеного індексу index до індексу останнього елемента), то під час формування нового масиву розмірністю в count,
// заповніть одиницями ті елементи, які не були скопійовані з вихідного масиву.
public class ReversedArray {
    static int[] array = null;
    public static void main(String[] args) {
        myReverse(array);
    }

    private static void myReverse(int[] array) {
    }
}
