import java.util.Scanner;

//Завдання 3
//
//Є N клієнтів, яким компанія-виробник має доставити товар. Скільки є можливих маршрутів доставлення товару з
// урахуванням того, що товар доставлятиме одна машина? Використовуючи IntelliJ IDEA, створіть клас Delivery.
// Напишіть програму, яка розраховуватиме та виводитиме на екран кількість можливих варіантів доставлення товару.
// Для розв'язку задачі, використовуйте факторіал N!, що розраховується рекурсією. Поясніть, чому не рекомендується
// використовувати рекурсію для розрахунку факторіала. Вкажіть слабкі місця цього підходу.
public class Delivery {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        System.out.print("Введіть кількість клієнтів N (> 0): ");
        int N = scanner.nextInt();

        if (N < 0) {
            System.out.println("Помилка: N має бути додатним.");
            return;
        }

        long routes = factorial(N);

        System.out.println("Кількість можливих маршрутів доставки: " + routes);
    }
    // Використання рекурсії не найкращий варіант тому, що вона працює повільніше ніж, наприклад, цикли. І при великих
    //значеннях ми треба використовувати типи даних з великим діапазоном, що не раціонально для використання пам'яті.
    //Оскільки рекурсії треба стековий фрейм для повернення "боргів" це вимагає більше пам'яті та процесорного часу.
    public static long factorial(int n) {
        if (n == 1 || n == 0) {
            return 1;
        }
        return n * factorial(n - 1);
    }
}