// Завдання 2
//
// Використовуючи IntelliJ IDEA, створіть клас Arithmetic Average. Обчисліть середнє арифметичне трьох цілих значень та
// виведіть його на екран. З якою проблемою ви зіткнулися? Який тип змінних краще використовуватиме для коректного
// показу результату?
public class Arithmetic_Average {
    public static void main(String[] args) {
        int x = 2;
        int y = 4;
        int z = 2;
        double average = 0;

        average = (double) (x + y + z) / 3;
        System.out.println(average);
    }
    // Проблеми з котрими стикнулися:
    // 1) Не можна створити клас Arithmetic Average із-за пробілу між двома словами.
    // 2) Таке враження до дії над Integer все одно повертають Integer.
    // 3) Для змінної в котру ми кладемо значення арифметичного середнього краще використовувати тип для дійсних чисел
    // 4) Оскільки повертався Integer треба було кастити до double
}
